backend/app/controllers/stories_controller.rb

  def set_user
    current_user = Story.find(params[:user_id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def set_story
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]